database/db_2.mmd
erDiagram
    Course {
        uuid id PK
        string title
        blob image
        text description
        json goals
        json timetable
        float price
        string introVideoUrl
        uuid teacherId FK
    }

    Teacher {
        uuid id PK
        string name
        blob photo
        text biography
        json certificates
        json socialMedia
    }

    Student {
        uuid id PK
        string name
        blob photo
    }

    Feedback {
        uuid id PK
        uuid studentId FK
        uuid courseId FK
        text comment
        int rating
    }

    Subscription {
        uuid id PK
        string name
        string type
        float price
        text description
    }

    CourseSubscription {
        uuid courseId PK,FK
        uuid subscriptionId PK,FK
    }

    Article {
        uuid id PK
        string title
        text content
        blob image
        json authors
        timestamp publishedAt
        text snippet
    }

    ArticleCourse {
        uuid articleId PK,FK
        uuid courseId PK,FK
    }

    Event {
        uuid id PK
        string title
        blob image
        timestamp date
        text description
        string location
        uuid teacherId FK
    }

    ArticleEvent {
        uuid articleId PK,FK
        uuid eventId PK,FK
    }

    StudentCourse {
        uuid studentId PK,FK
        uuid courseId PK,FK
        timestamp enrollmentDate
        string status
    }

    Equipement {
        uuid id PK
        string name
        blob image
        text description
    }

    CourseEquipement {
        uuid courseId PK,FK
        uuid equipementId PK,FK
        int quantity
        boolean isRequired
    }

    Teacher ||--o{ Course : "teach"
    Student ||--o{ Feedback : "give"
    Course ||--o{ Feedback : "get"
    Course ||--o{ CourseSubscription : "included in"
    Subscription ||--o{ CourseSubscription : "include"
    Article ||--o{ ArticleCourse : "for"
    Course ||--o{ ArticleCourse : "mentioned in"
    Article ||--o{ ArticleEvent : "for"
    Event ||--o{ ArticleEvent : "mentioned in"
    Teacher ||--o{ Event : "animate"
    Student ||--o{ StudentCourse : "register in"
    Course ||--o{ StudentCourse : "follow by"
    Course ||--o{ CourseEquipement : "employ"
    Equipement ||--o{ CourseEquipement : "used in"
